In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# 결측치 처리 내용
trade = pd.read_csv("trade.csv")
trade = trade.drop("기타사항", axis=1)
trade.dropna(how="all", subset=["수출건수", "수출금액", "수입건수", "수입금액", "무역수지"], inplace=True)
trade.loc[191, '수출금액'] = (trade.loc[188, '수출금액'] + trade.loc[194, '수출금액'] )/2
trade.loc[191, '무역수지'] = (trade.loc[188, '무역수지'] + trade.loc[194, '무역수지'] )/2
trade.isnull().sum()

기간      0
국가명     0
수출건수    0
수출금액    0
수입건수    0
수입금액    0
무역수지    0
dtype: int64

In [3]:
trade.head()

          기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
0  2015년 01월  중국  116932.0  12083947.0  334522.0  8143271.0  3940676.0
1  2015년 01월  미국   65888.0   5561545.0  509564.0  3625062.0  1936484.0
2  2015년 01월  일본   54017.0   2251307.0   82480.0  3827247.0 -1575940.0
3  2015년 02월  중국   86228.0   9927642.0  209100.0  6980874.0  2946768.0
4  2015년 02월  미국   60225.0   5021264.0  428678.0  2998216.0  2023048.0

In [5]:
# 중복치를 확인하기 위한 duplicated
trade.duplicated().sum()

1

In [6]:
trade[trade.duplicated()]

            기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
187  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0

In [7]:
# 다른 중복열을 찾아보기위한 한 가지 방법
trade[(trade['기간']=='2020년 03월')&(trade['국가명']=='중국')]

            기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
186  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0
187  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0

In [8]:
# drop_duplicates는 중복열을 삭제해줌
trade.drop_duplicates(inplace=True)

#### 아래는 duplicates 예시

In [13]:
df = pd.DataFrame({'id':['001', '002', '003', '004', '002'],
                   'name':['Park Yun', 'Kim Sung', 'Park Jin', 'Lee Han', 'Kim Min']})
df

    id      name
0  001  Park Yun
1  002  Kim Sung
2  003  Park Jin
3  004   Lee Han
4  002   Kim Min

In [16]:
df.duplicated(subset="id")

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [17]:
df.drop_duplicates(subset="id", keep="last", inplace=True)
df

    id      name
0  001  Park Yun
2  003  Park Jin
3  004   Lee Han
4  002   Kim Min